-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Окт 09 2026 г., 13:36
-- Версия сервера: 10.3.36-MariaDB
-- Версия PHP: 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `messenger`
--

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `ID` int(50) NOT NULL,
  `Логин` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `Пароль` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `Имя` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `Фамилия` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `Отчество` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `Номер телефона` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`ID`, `Логин`, `Пароль`, `Имя`, `Фамилия`, `Отчество`, `Номер телефона`) VALUES
(1, 'orlova.io31', '8EO!J!WN%A0W', 'Ирина', 'Орлова', 'Олеговна', '8 (971) 514-30-68'),
(2, 'zakharov.aa20', 'su2#n!q9D', 'Алексей', 'Захаров', 'Андреевич', '8 (942) 150-68-14'),
(3, 'morozov.av21', 'SQXm4%kEWELM', 'Алексей', 'Морозов', 'Викторович', '8 (976) 288-10-15'),
(4, 'andreeva.as71', 'V8IA%2%Louo', 'Анна', 'Андреева', 'Сергеевна', '8 (952) 497-63-89'),
(5, 'nikolaev.ad54', 'qI45Jk$!', 'Александр', 'Николаев', 'Данилович', '8 (953) 836-49-74'),
(6, 'andreeva.la92', '47@I%3PK', 'Людмила', 'Андреева', 'Алексеевна', '8 (944) 784-90-20'),
(7, 'vasilev.da81', '#N9WMFl3', 'Дмитрий', 'Васильев', 'Андреевич', '8 (920) 174-13-42'),
(8, 'soloveva.zd47', 'iJCcJ$BzX9z', 'Зоя', 'Соловьева', 'Даниловна', '8 (979) 467-39-12'),
(9, 'pavlova.ea53', '%NivPyD9Td', 'Елена', 'Павлова', 'Александровна', '8 (921) 763-96-93'),
(10, 'lebedev.ae30', 'NJ8I3$Fko', 'Артем', 'Лебедев', 'Евгеньевич', '8 (940) 489-15-78'),
(11, 'andreev.ia79', 'Q0Eh3EZkG%C', 'Игорь', 'Андреев', 'Александрович', '8 (996) 798-42-14'),
(12, 'andreeva.np82', 'zVE#Ud9Y', 'Наталья', 'Андреева', 'Петровна', '8 (920) 171-83-43'),
(13, 'zakharov.ea54', 'RPU%QT2p', 'Евгений', 'Захаров', 'Андреевич', '8 (975) 994-31-41'),
(14, 'ivanov.ao92', 'Tt8wgE%a5', 'Алексей', 'Иванов', 'Олегович', '8 (966) 364-10-63'),
(15, 'morozov.da68', 'Ii#CS7%7l', 'Дмитрий', 'Морозов', 'Алексеевич', '8 (948) 558-24-15'),
(16, 'fedorov.av57', 'Ty@z7!ZNF9H', 'Артем', 'Федоров', 'Владимирович', '8 (913) 471-93-38'),
(17, 'morozov.an40', '!6f6@gzV%LY9', 'Арсений', 'Морозов', 'Николаевич', '8 (994) 363-45-52'),
(18, 'pavlova.td19', '6tE50%!sPVh', 'Татьяна', 'Павлова', 'Даниловна', '8 (975) 348-58-95'),
(19, 'vorobeva.vt22', 'hEmwcSH4G6@', 'Валерия', 'Воробьева', 'Тимофеевна', '8 (958) 536-11-32'),
(20, 'grigorev.ti17', 'jA!#5b2WbtTq', 'Тимофей', 'Григорьев', 'Иванович', '8 (976) 239-48-29'),
(21, 'andreeva.vv20', 'ltEIv5uv%', 'Валерия', 'Андреева', 'Владимировна', '8 (965) 674-38-85'),
(22, 'sergeeva.ga72', '4b!5L%w#', 'Галина', 'Сергеева', 'Александровна', '8 (977) 842-92-39'),
(23, 'egorov.at50', 'E1tbi5O#', 'Арсений', 'Егоров', 'Тимофеевич', '8 (914) 494-43-42'),
(24, 'zaytsev.ad54', 'KtI9INF4g%W', 'Алексей', 'Зайцев', 'Данилович', '8 (940) 320-41-52'),
(25, 'zakharov.ro97', 'Q0a!vD1Mg$X', 'Руслан', 'Захаров', 'Олегович', '8 (937) 330-85-22'),
(26, 'vorobeva.mp23', 'WW%5NwFx', 'Марина', 'Воробьева', 'Петровна', '8 (975) 592-25-27'),
(27, 'andreeva.id67', 'GDC9dZ#0V', 'Ирина', 'Андреева', 'Даниловна', '8 (973) 493-11-41'),
(28, 'vorobev.km82', 'qsL90LgN@C0!', 'Кирилл', 'Воробьев', 'Максимович', '8 (933) 530-85-15'),
(29, 'volkova.an20', 'f!EctVm#bC7u', 'Анастасия', 'Волкова', 'Николаевна', '8 (989) 462-41-49'),
(30, 'fedorov.am35', 'ND8wL%0q1BP%', 'Александр', 'Федоров', 'Михайлович', '8 (960) 926-44-19'),
(31, 'vorobev.ii61', 'au$V0CmfYk', 'Илья', 'Воробьев', 'Игоревич', '8 (997) 498-93-24'),
(32, 'semenova.dv42', '8j9%aTid5T', 'Дарья', 'Семенова', 'Викторовна', '8 (931) 547-17-68'),
(33, 'mikhaylov.dd23', 'hc%5Tz1k', 'Денис', 'Михайлов', 'Данилович', '8 (988) 679-80-18'),
(34, 'volkova.ip19', 'cT5S#MOgzM', 'Ирина', 'Волкова', 'Павловна', '8 (919) 269-61-56'),
(35, 'yakovlev.ao97', 'V%NK@LsER4', 'Артем', 'Яковлев', 'Олегович', '8 (961) 701-59-33'),
(36, 'alekseeva.to89', '0YrmI$wqfx', 'Татьяна', 'Алексеева', 'Олеговна', '8 (997) 409-61-27'),
(37, 'kuznetsova.st94', 'mbT2Qx3@', 'Светлана', 'Кузнецова', 'Тимофеевна', '8 (975) 827-52-69'),
(38, 'novikova.en53', 'qH%e5FI#', 'Екатерина', 'Новикова', 'Николаевна', '8 (919) 975-96-11'),
(39, 'soloveva.sa19', 'RWa3HN%K4G9P', 'Светлана', 'Соловьева', 'Александровна', '8 (985) 623-51-80'),
(40, 'semenov.na54', '86gyIGNxS$Y', 'Никита', 'Семенов', 'Андреевич', '8 (981) 800-13-59'),
(41, 'kuznetsova.md82', '#3hQRZURny%6', 'Марина', 'Кузнецова', 'Даниловна', '8 (992) 210-21-72'),
(42, 'lebedev.da82', '0x5D7vAg$E', 'Даниил', 'Лебедев', 'Алексеевич', '8 (911) 175-62-92'),
(43, 'nikolaeva.ap16', '$YX9%83b', 'Анастасия', 'Николаева', 'Павловна', '8 (994) 411-11-36'),
(44, 'egorov.ap92', '$jT@Dd2K2', 'Алексей', 'Егоров', 'Павлович', '8 (964) 590-20-61'),
(45, 'ivanova.nt75', 'qYX@818I4wV3', 'Наталья', 'Иванова', 'Тимофеевна', '8 (963) 163-11-21'),
(46, 'petrov.ms85', '3T8kEQq$', 'Матвей', 'Петров', 'Сергеевич', '8 (986) 327-19-89'),
(47, 'smirnova.at74', '2H69evcqf#', 'Анна', 'Смирнова', 'Тимофеевна', '8 (999) 477-88-62'),
(48, 'vorobev.tn76', '6F%NzBX!$fXP', 'Тимофей', 'Воробьев', 'Николаевич', '8 (996) 322-25-59'),
(49, 'grigorev.da97', 'H2U3%6e0qrq', 'Денис', 'Григорьев', 'Андреевич', '8 (980) 407-56-27'),
(50, 'alekseev.sn98', 'U4s%ZzAJu', 'Сергей', 'Алексеев', 'Николаевич', '8 (960) 471-59-32');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`ID`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `ID` int(50) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
